framework/app/controllers/home_controller.rb

INSERT INTO "maps" ("map_name", "num_of_squares", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["map_name", "呪われた廃屋：深夜の探索"], ["num_of_squares", 11], ["created_at", "2026-06-03 08:03:37.940394"], ["updated_at", "2026-06-03 08:03:37.940394"]]
INSERT INTO "squares" ("map_id", "position", "square_type", "square_text", "effect", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "maps" ("map_name", "num_of_squares", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["map_name", "東海道五十三次！東京から京都へ歩くスゴロク"], ["num_of_squares", 20], ["created_at", "2026-06-02 14:15:18.597266"], ["updated_at", "2026-06-02 14:15:18.597266"]]
---
  def generate
    prompt = params[:prompt]

    # テスト用: プロンプトが空の場合はサンプルマップを表示
    if prompt.blank?
      json_path = Rails.root.join("maps","samplemap.json")
      json_data = JSON.parse(File.read(json_path))
      @sugoroku = json_data
      return
    end

    result = AiService.generate(prompt)

    map = Map.create!(
      map_name: result["title"],
      num_of_squares: result["squares"].length
    )

    session[:map_id] = map.id

    result["squares"].each_with_index do |square, index|
      map.squares.create!(
        position: index + 1,
        square_type: square["type"],
        square_text: square["text"],
        effect: square["effect"],
        value: square["value"]
      )