framework/app/controllers/play_controller.rb

SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "squares".* FROM "squares" WHERE "squares"."map_id" = ? ORDER BY "squares"."position" ASC  [["map_id", 16]]
---
  def top
    if session[:map_id]
      @map = Map.find_by(id: session[:map_id])

      if @map
        @sugoroku = {
          "title" => @map.map_name,
          "squares" => @map.squares.order(:position).map do |square|

SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT "squares".* FROM "squares" WHERE "squares"."map_id" = ? ORDER BY "squares"."position" ASC  [["map_id", 19]]
---
  def play
    # 1. セッションからプレイヤー人数を復元してViewに渡す
    @player_count = session[:player_count] || 2 # 万が一空っぽなら2人にする
    @player_names = session[:player_names]
    @player_colors = session[:player_colors]
    puts "プレイヤーの名前: #{@player_names}"
    puts "プレイヤーの選択した色: #{@player_colors}"

    # 2. スゴロクのマップデータも play 画面用にここで読み込んでViewに渡す！
    if session[:map_id]
      @map = Map.find_by(id: session[:map_id])

      if @map
        @sugoroku = {
          "title" => @map.map_name,
          "squares" => @map.squares.order(:position).map do |square|