framework/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(uname: params[:uname])
---
SELECT "users".* FROM "users" WHERE "users"."uname" = ? LIMIT ?  [["uname", "test1"], ["LIMIT", 1]]