framework/app/controllers/users_controller.rb

INSERT INTO "users" ("uname", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["uname", "test1"], ["password_digest", "[FILTERED]"], ["created_at", "2026-06-03 06:12:00.135562"], ["updated_at", "2026-06-03 06:12:00.135562"]]
---
  def create
    @user = User.new(user_params)

    if @user.save